ashen1queter/nrf52-donggle/pika/nRF5_SDK_17.1.0_ddde560/nRF5_SDK_17.1.0_ddde560/examples/jesica/ble_app_blinky/main.c
        if (err_code != NRF_SUCCESS &&
            err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
            err_code != NRF_ERROR_INVALID_STATE &&
            err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
        {
            APP_ERROR_CHECK(err_code);
            NRF_LOG_DEBUG("Sent button change 0x%x on connection handle 0x%x.", button_action, conn_handles.conn_handles[i]);
        }
    }
    return NRF_SUCCESS;
}


/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
    ret_code_t err_code;

    switch (pin_no)
    {
        case LEDBUTTON_BUTTON:
            err_code = led_status_send_to_all(button_action);
            if (err_code == NRF_SUCCESS)
            {
                NRF_LOG_INFO("Sent button state change to all connected centrals.");
            }
            break;

        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}


static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;

    switch(p_evt->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:
							NRF_LOG_DEBUG("PM_EVT_BONDED_PEER_CONNECTED");
            // Update the rank of the peer.
            err_code = pm_peer_rank_highest(p_evt->peer_id);
            break;
        case PM_EVT_CONN_SEC_START:
					NRF_LOG_DEBUG("PM_EVT_CONN_SEC_START");
            break;
        case PM_EVT_CONN_SEC_SUCCEEDED:
					NRF_LOG_DEBUG("PM_EVT_CONN_SEC_SUCCEEDED");
            // Update the rank of the peer.
            err_code = pm_peer_rank_highest(p_evt->peer_id);
            break;
        case PM_EVT_CONN_SEC_FAILED:
					NRF_LOG_DEBUG("PM_EVT_CONN_SEC_FAILED");
            // In some cases, when securing fails, it can be restarted directly. Sometimes it can be
            // restarted, but only after changing some Security Parameters. Sometimes, it cannot be
            // restarted until the link is disconnected and reconnected. Sometimes it is impossible
            // to secure the link, or the peer device does not support it. How to handle this error
            // is highly application-dependent.
//            NRF_LOG_INFO("Failed to secure connection. Disconnecting.");
//            err_code = sd_ble_gap_disconnect(m_conn_handle,
//                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
//            if (err_code != NRF_ERROR_INVALID_STATE)
//            {
//                APP_ERROR_CHECK(err_code);
//            }
//            m_conn_handle = BLE_CONN_HANDLE_INVALID;

				
            break;
        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
					NRF_LOG_DEBUG("PM_EVT_CONN_SEC_CONFIG_REQ");
            // A connected peer (central) is trying to pair, but the Peer Manager already has a bond
            // for that peer. Setting allow_repairing to false rejects the pairing request.
            // If this event is ignored (pm_conn_sec_config_reply is not called in the event
            // handler), the Peer Manager assumes allow_repairing to be false.
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        }
        break;
        case PM_EVT_CONN_SEC_PARAMS_REQ:
        {
					NRF_LOG_DEBUG("PM_EVT_CONN_SEC_PARAMS_REQ");
            // If you want to set different security parameters for particular peers, you can do
            // so here. Pass the desired security parameters to pm_conn_sec_params_reply().
//            err_code = pm_conn_sec_params_reply(p_evt->conn_handle,
//                                               &sec_param,
//                                                p_evt->params.conn_sec_params_req.p_context);
//            APP_ERROR_CHECK(err_code);
        } break;
        case PM_EVT_STORAGE_FULL:
					NRF_LOG_DEBUG("PM_EVT_STORAGE_FULL");
            // Run garbage collection on the flash.
            err_code = fds_gc();
            if (err_code == FDS_ERR_BUSY || err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
            {
                // Retry.
            }
            else
            {
                APP_ERROR_CHECK(err_code);
            }
            break;
        case PM_EVT_ERROR_UNEXPECTED:
					NRF_LOG_DEBUG("PM_EVT_ERROR_UNEXPECTED");
            // Assert.
            APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
            break;
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
					NRF_LOG_DEBUG("PM_EVT_PEER_DATA_UPDATE_SUCCEEDED");
            break;
        case PM_EVT_PEER_DATA_UPDATE_FAILED:
					NRF_LOG_DEBUG("PM_EVT_PEER_DATA_UPDATE_SUCCEEDED");
            // Assert.
            APP_ERROR_CHECK_BOOL(false);
            break;
        case PM_EVT_PEER_DELETE_SUCCEEDED:
					NRF_LOG_DEBUG("PM_EVT_PEER_DELETE_SUCCEEDED");
            break;
        case PM_EVT_PEER_DELETE_FAILED:
					NRF_LOG_DEBUG("PM_EVT_PEER_DELETE_FAILED");
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
            break;
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
					NRF_LOG_DEBUG("PM_EVT_PEERS_DELETE_SUCCEEDED");
            // At this point it is safe to start advertising or scanning.
            break;
        case PM_EVT_PEERS_DELETE_FAILED:
					NRF_LOG_DEBUG("PM_EVT_PEERS_DELETE_FAILED");
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
            break;
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
					NRF_LOG_DEBUG("PM_EVT_LOCAL_DB_CACHE_APPLIED");
            break;
        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
					NRF_LOG_DEBUG("PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED");
            // The local database has likely changed, send service changed indications.
            pm_local_database_has_changed();
            break;
        case PM_EVT_SERVICE_CHANGED_IND_SENT:
					NRF_LOG_DEBUG("PM_EVT_SERVICE_CHANGED_IND_SENT");
            break;
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
					NRF_LOG_DEBUG("PM_EVT_SERVICE_CHANGED_IND_CONFIRMED");
            break;
}
	
	
